package kotlincourse.lessons.lesson12.homework

import kotlincourse.lessons.lesson08.empty


fun main() {

//Задачи на приведение коллекции к значению
//   Проверить, что размер коллекции больше 5 элементов.
    val ex1 = listOf(1, 2, 3, 4, 5, 6)
    println(ex1.size > 5)

//    Проверить, что коллекция пустая
    println(ex1.isEmpty())

//    Проверить, что коллекция не пустая
    println(ex1.isNotEmpty())

//    Взять элемент по индексу или создать значение если индекса не существует
    println(ex1.getOrElse(1) { 123 })

//    Собрать коллекцию в строку
    println(ex1.joinToString())
//            Посчитать сумму всех значений
    println(ex1.sum())
//            Посчитать среднее
    println(ex1.average())
//            Взять максимальное число
    println(ex1.maxOrNull())
//    Взять минимальное число
    println(ex1.minOrNull())
//    Взять первое число или null
    println(ex1.firstOrNull())
//    Проверить что коллекция содержит элемент
    println(ex1.contains(1443))
    println(2 in ex1)

//    Задачи на обработку коллекций
//            Отфильтровать коллекцию по диапазону 18-30
    val filter13 = ex1.filter { it in 18..30 }

//   Выбрать числа, которые не делятся на 2 и 3 одновременно
    //   ex1.filter { it % 2 != 0 && it % 3 != 0 }
    ex1.filterNot { it % 6 == 0 }
//    Очистить текстовую коллекцию от null элементов
    val ex2 = listOf("text", null)
    ex2.filterNotNull()
//            Преобразовать текстовую коллекцию в коллекцию длин слов
    val ex3 = ex2.filterNotNull().map { it.length }
    val ex4 = ex2.mapNotNull { it?.length }

//    Преобразовать текстовую коллекцию в мапу, где ключи - слова, а значения - перевёрнутые слова
    val ex5 = listOf("text", "warn", "text2")
    ex5.associate { it to it.reversed() }
    ex5.associateWith { it.reversed() } //alt

//    Отсортировать список в алфавитном порядке
    ex5.sorted()

//    Отсортировать список по убыванию
    ex5.sortedDescending()
//            Распечатать квадраты элементов списка
    ex1.forEach {
        print("-----")
        println(it * it)
        print("-----")
    }
//            Группировать список по первой букве слов
    println(ex5.groupBy {
        it[0]
    })

//            Очистить список от дублей
    ex5.distinct()
//            Взять первые 3 элемента списка
    ex5.take(3)
//    Взять последние 3 элемента списка
    ex5.takeLast(3)
//Реши задачи ниже в отдельных функциях.

//Задача 24. Характеристика числовой коллекции

    //Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой коллекции используя конструкцию when
    fun ex24(a: List<Int>): String {
        return when {
            a.isEmpty() -> "Empty" //Если коллекция пустая - “Пусто”
            (a.size < 5) -> "Short" //Если количество элементов меньше пяти - “Короткая”
            a.firstOrNull() == 0 -> "Starting" //Если коллекция начинается с 0 - “Стартовая”
            (a.sum() > 10000) -> "Massive" //Если сумма всех чисел больше 10000 - “Массивная”
            a.average() == 10.00 -> "balanced" //Если среднее значение равно 10 - “Сбалансированная”
            (a.joinToString().length == 20) -> "Sticky" //Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
            (a.maxOrNull()!! < -10) -> "Negative" //Если максимальное число меньше -10 - “Отрицательная”
            (a.minOrNull()!! > 1000) -> "Positive" //Если минимальное число больше 1000 - “Положительная”
            (a.contains(3) && a.contains(14)) -> "Pi" //Если содержит одновременно числа 3 и 14 - “Пи***тая”
            else -> "Unique" //Иначе - “Уникальная”
        }
    }

//    Задача 25. Анализ учебных оценок
//    Напиши функцию, которая принимает список чисел и возвращает список чисел.
//    Пример данных:
    val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)

    //    Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать оставшиеся по возрастанию и взять первые 3.
    //    Вызывай методы обработки и фильтрации последовательно один из другого, чтобы результат предыдущего метода являлся основой для следующего.
    fun gradesSorted(grades: List<Int>): List<Int> {
        return grades.filter { it >= 60 }.sorted().take(3)
    }

//    Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - списком строк.
//


    //    Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy
    fun listGrouped(list: List<String>): Map<Char, List<String>> {
        return list
            .map { it.lowercase() }
            .groupBy { it[0] }
    }
    //    Начальные значения:
    println(
        listGrouped(
            listOf(
                "Стол",
                "табурет",
                "ваза",
                "Кружка",
                "Зеркало",
                "ковер",
                "Шкаф",
                "часы",
                "Люстра",
                "подушка",
                "Картина",
                "столик",
                "Вазон",
                "шторы",
                "Пуф",
                "книга",
                "Фоторамка",
                "светильник",
                "Коврик",
                "вешалка",
                "Подставка",
                "телевизор",
                "Комод",
                "полка",
                "Абажур",
                "диван",
                "Кресло",
                "занавеска",
                "Бра",
                "пепельница",
                "Глобус",
                "статуэтка",
                "Поднос",
                "фигурка",
                "Ключница",
                "плед",
                "Тумба",
                "игрушка",
                "Настенные часы",
                "подсвечник",
                "Журнальный столик",
                "сувенир",
                "Корзина для белья",
                "посуда",
                "Настольная лампа",
                "торшер",
                "Этажерка"
            )
        )
    )

    //    Задание 27. Подсчёт средней длины слов в списке
//    Напиши функцию, которая принимает список строк и возвращает строку.
//    Начальные значения взять из предыдущей задачи.
//    Цель: Перевести все слова в количество букв, подсчитать среднее значение. Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.
    fun averageLength(avLength: List<String>): String {
        return "%.2f".format(avLength
            .map { it.length }
            .average())
    }
    println(averageLength(listOf("kotlin", "java", "go", "scala")))

}